package Lesson_3.Phonebook;


/** Написать простой класс ТелефонныйСправочник, который хранит в себе список фамилий и телефонных номеров.
 * <p>
 * В этот телефонный справочник с помощью метода add() можно добавлять записи.
 * <p>
 * С помощью метода get() искать номер телефона по фамилии.
 * <p>
 * Следует учесть, что под одной фамилией может быть несколько телефонов, тогда при запросе такой фамилии должны выводиться все телефоны.
 * <p>
 * Желательно как можно меньше добавлять своего, чего нет в задании
 * (т.е. не надо в телефонную запись добавлять еще дополнительные поля (имя, отчество, адрес),
 * делать взаимодействие с пользователем через консоль и т.д.).
 * <p>
 * Консоль желательно не использовать (в том числе Scanner), тестировать просто из метода main() прописывая add() и get().
 */
public class Phonebook {

}
